from utils import get_lines

lines = get_lines('number.txt')

# используем словарь и кортежи в качестве ключей
digits  = {
	('**','**','**','**'): '0',
	(' *','**',' *',' *'): '1',
	('**',' *','* ','**'): '2',
	('**',' *',' *','**'): '3',
	('**','**',' *',' *'): '4',
	('**','* ',' *','**'): '5',
	(' *','* ','**','**'): '6',
	('**',' *','* ','* '): '7',
	('**','  ','**','**'): '8',
	('**','**',' *','* '): '9'
}

result = ''
for pos in range(0, len(lines[0]), 2):
	dig = [line[pos:pos+2] for line in lines]
	result += digits[tuple(dig)]

print(result)
